RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_mipi_dsi_phy_regs.h
/*
 * BIST_N_OK (RO)
 *
 * indicate prbs7 bist test is ok
 */
#define MIPI_DSI_PHY_TEST_PARA0_BIST_N_OK_MASK (0xF80U)
#define MIPI_DSI_PHY_TEST_PARA0_BIST_N_OK_SHIFT (7U)
#define MIPI_DSI_PHY_TEST_PARA0_BIST_N_OK_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TEST_PARA0_BIST_N_OK_MASK) >> MIPI_DSI_PHY_TEST_PARA0_BIST_N_OK_SHIFT)

/*
 * ATEST_EN (RW)
 *
 * analog test signal enable
 */
#define MIPI_DSI_PHY_TEST_PARA0_ATEST_EN_MASK (0x40U)
#define MIPI_DSI_PHY_TEST_PARA0_ATEST_EN_SHIFT (6U)
#define MIPI_DSI_PHY_TEST_PARA0_ATEST_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TEST_PARA0_ATEST_EN_SHIFT) & MIPI_DSI_PHY_TEST_PARA0_ATEST_EN_MASK)
#define MIPI_DSI_PHY_TEST_PARA0_ATEST_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TEST_PARA0_ATEST_EN_MASK) >> MIPI_DSI_PHY_TEST_PARA0_ATEST_EN_SHIFT)

/*
 * ATEST_SEL (RW)
 *
 * analog test signal select
 */
#define MIPI_DSI_PHY_TEST_PARA0_ATEST_SEL_MASK (0x30U)
#define MIPI_DSI_PHY_TEST_PARA0_ATEST_SEL_SHIFT (4U)
#define MIPI_DSI_PHY_TEST_PARA0_ATEST_SEL_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TEST_PARA0_ATEST_SEL_SHIFT) & MIPI_DSI_PHY_TEST_PARA0_ATEST_SEL_MASK)
#define MIPI_DSI_PHY_TEST_PARA0_ATEST_SEL_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TEST_PARA0_ATEST_SEL_MASK) >> MIPI_DSI_PHY_TEST_PARA0_ATEST_SEL_SHIFT)

/*
 * FSET_EN (RW)
 *
 * enable fast transmission between lp-tx and hs-tx
 */
#define MIPI_DSI_PHY_TEST_PARA0_FSET_EN_MASK (0x8U)
#define MIPI_DSI_PHY_TEST_PARA0_FSET_EN_SHIFT (3U)
#define MIPI_DSI_PHY_TEST_PARA0_FSET_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TEST_PARA0_FSET_EN_SHIFT) & MIPI_DSI_PHY_TEST_PARA0_FSET_EN_MASK)
#define MIPI_DSI_PHY_TEST_PARA0_FSET_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TEST_PARA0_FSET_EN_MASK) >> MIPI_DSI_PHY_TEST_PARA0_FSET_EN_SHIFT)

/*
 * FT_SEL (RW)
 *
 * pt/ft test mode select
 */
#define MIPI_DSI_PHY_TEST_PARA0_FT_SEL_MASK (0x7U)
#define MIPI_DSI_PHY_TEST_PARA0_FT_SEL_SHIFT (0U)
#define MIPI_DSI_PHY_TEST_PARA0_FT_SEL_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TEST_PARA0_FT_SEL_SHIFT) & MIPI_DSI_PHY_TEST_PARA0_FT_SEL_MASK)
#define MIPI_DSI_PHY_TEST_PARA0_FT_SEL_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TEST_PARA0_FT_SEL_MASK) >> MIPI_DSI_PHY_TEST_PARA0_FT_SEL_SHIFT)

/* Bitfield definition for register: TEST_PARA1 */
/*
 * CHECK_NUM (RW)
 *
 * the byte num of prbs bist check num
 */
#define MIPI_DSI_PHY_TEST_PARA1_CHECK_NUM_MASK (0xFFFFFC00UL)
#define MIPI_DSI_PHY_TEST_PARA1_CHECK_NUM_SHIFT (10U)
#define MIPI_DSI_PHY_TEST_PARA1_CHECK_NUM_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TEST_PARA1_CHECK_NUM_SHIFT) & MIPI_DSI_PHY_TEST_PARA1_CHECK_NUM_MASK)
#define MIPI_DSI_PHY_TEST_PARA1_CHECK_NUM_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TEST_PARA1_CHECK_NUM_MASK) >> MIPI_DSI_PHY_TEST_PARA1_CHECK_NUM_SHIFT)

/*
 * ERR_THRESHOLD (RW)
 *
 * the threshold of prbs bit error
 */
#define MIPI_DSI_PHY_TEST_PARA1_ERR_THRESHOLD_MASK (0x3C0U)
#define MIPI_DSI_PHY_TEST_PARA1_ERR_THRESHOLD_SHIFT (6U)
#define MIPI_DSI_PHY_TEST_PARA1_ERR_THRESHOLD_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TEST_PARA1_ERR_THRESHOLD_SHIFT) & MIPI_DSI_PHY_TEST_PARA1_ERR_THRESHOLD_MASK)
#define MIPI_DSI_PHY_TEST_PARA1_ERR_THRESHOLD_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TEST_PARA1_ERR_THRESHOLD_MASK) >> MIPI_DSI_PHY_TEST_PARA1_ERR_THRESHOLD_SHIFT)

/*
 * BIST_BIT_ERROR (RW)
 *
 * enable insert error in bist test pattern
 */
#define MIPI_DSI_PHY_TEST_PARA1_BIST_BIT_ERROR_MASK (0x20U)
#define MIPI_DSI_PHY_TEST_PARA1_BIST_BIT_ERROR_SHIFT (5U)
#define MIPI_DSI_PHY_TEST_PARA1_BIST_BIT_ERROR_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TEST_PARA1_BIST_BIT_ERROR_SHIFT) & MIPI_DSI_PHY_TEST_PARA1_BIST_BIT_ERROR_MASK)
#define MIPI_DSI_PHY_TEST_PARA1_BIST_BIT_ERROR_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TEST_PARA1_BIST_BIT_ERROR_MASK) >> MIPI_DSI_PHY_TEST_PARA1_BIST_BIT_ERROR_SHIFT)

/*
 * BIST_EN (RW)
 *
 * bist enable
 */
#define MIPI_DSI_PHY_TEST_PARA1_BIST_EN_MASK (0x18U)
#define MIPI_DSI_PHY_TEST_PARA1_BIST_EN_SHIFT (3U)
#define MIPI_DSI_PHY_TEST_PARA1_BIST_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TEST_PARA1_BIST_EN_SHIFT) & MIPI_DSI_PHY_TEST_PARA1_BIST_EN_MASK)
#define MIPI_DSI_PHY_TEST_PARA1_BIST_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TEST_PARA1_BIST_EN_MASK) >> MIPI_DSI_PHY_TEST_PARA1_BIST_EN_SHIFT)

/*
 * BIST_SEL (RW)
 *
 * bist mode select
 */
#define MIPI_DSI_PHY_TEST_PARA1_BIST_SEL_MASK (0x4U)
#define MIPI_DSI_PHY_TEST_PARA1_BIST_SEL_SHIFT (2U)
#define MIPI_DSI_PHY_TEST_PARA1_BIST_SEL_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TEST_PARA1_BIST_SEL_SHIFT) & MIPI_DSI_PHY_TEST_PARA1_BIST_SEL_MASK)
#define MIPI_DSI_PHY_TEST_PARA1_BIST_SEL_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TEST_PARA1_BIST_SEL_MASK) >> MIPI_DSI_PHY_TEST_PARA1_BIST_SEL_SHIFT)

/*
 * PRBS_SEL (RW)
 *
 * prbs generator and checker pattern select signal
 */
#define MIPI_DSI_PHY_TEST_PARA1_PRBS_SEL_MASK (0x3U)
#define MIPI_DSI_PHY_TEST_PARA1_PRBS_SEL_SHIFT (0U)
#define MIPI_DSI_PHY_TEST_PARA1_PRBS_SEL_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TEST_PARA1_PRBS_SEL_SHIFT) & MIPI_DSI_PHY_TEST_PARA1_PRBS_SEL_MASK)
#define MIPI_DSI_PHY_TEST_PARA1_PRBS_SEL_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TEST_PARA1_PRBS_SEL_MASK) >> MIPI_DSI_PHY_TEST_PARA1_PRBS_SEL_SHIFT)

/* Bitfield definition for register: MISC_PARA */
/*
 * DLL_SEL (RW)
 *
 * the phase select of clk_rxesc
 */
#define MIPI_DSI_PHY_MISC_PARA_DLL_SEL_MASK (0x780U)
#define MIPI_DSI_PHY_MISC_PARA_DLL_SEL_SHIFT (7U)
#define MIPI_DSI_PHY_MISC_PARA_DLL_SEL_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_MISC_PARA_DLL_SEL_SHIFT) & MIPI_DSI_PHY_MISC_PARA_DLL_SEL_MASK)
#define MIPI_DSI_PHY_MISC_PARA_DLL_SEL_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_MISC_PARA_DLL_SEL_MASK) >> MIPI_DSI_PHY_MISC_PARA_DLL_SEL_SHIFT)

/*
 * LANE_NUM (RW)
 *
 * the number of active data lanes
 */
#define MIPI_DSI_PHY_MISC_PARA_LANE_NUM_MASK (0x60U)
#define MIPI_DSI_PHY_MISC_PARA_LANE_NUM_SHIFT (5U)
#define MIPI_DSI_PHY_MISC_PARA_LANE_NUM_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_MISC_PARA_LANE_NUM_SHIFT) & MIPI_DSI_PHY_MISC_PARA_LANE_NUM_MASK)
#define MIPI_DSI_PHY_MISC_PARA_LANE_NUM_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_MISC_PARA_LANE_NUM_MASK) >> MIPI_DSI_PHY_MISC_PARA_LANE_NUM_SHIFT)

